
&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	Данные = Whatsgate_Клиент.ПолучитьСтруктуруДанных(0);
	Данные.Асинхронно = Ложь;
	Данные.Получатель.ЭтоГруппа = Ложь;
	Данные.Получатель.Номер = "79285295190";
	Данные.Сообщение.Текст = "Отправлено из 1С";
	//
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если ДВФ.Выбрать() Тогда
		Данные = Whatsgate_Клиент.ПрикрепитьФайл(Данные,ДВФ.ПолноеИмяФайла);
	КонецЕсли;
	Результат = Whatsgate_Клиент.ОтправитьСообщение(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьКакПрочитанное(Команда)
	Данные = Whatsgate_Клиент.ПолучитьСтруктуруДанных(1);
	Данные.ЭтоГруппа = Ложь;
	Данные.Номер = "79285295190";
	Результат = Whatsgate_Клиент.ПометитьКакПрочитанное(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМедиаФайл(Команда)
	Результат = Whatsgate_Клиент.ПолучитьПрикрепленныйМедиафайл("xa4m1xe4LBqIlIgiwdw+6mmzeqVqvHCemmc7yYGQQvM=");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗарегистрированЛиПользователь(Команда)
	Результат = Whatsgate_Клиент.ПроверитьЗарегистрированЛиНомер("79285295190");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсеАктивныеЧаты(Команда)
	Результат = Whatsgate_Клиент.ПолучитьВсеАктивныеЧаты();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСессию(Команда)
	Результат = Whatsgate_Клиент.СоздатьНовуюСессию("test");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсеСессии(Команда)
	Результат = Whatsgate_Клиент.ПолучитьВсеСессии();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИмяСессии(Команда)
	Результат = Whatsgate_Клиент.ИзменитьИмяСессии("Nabi");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеСессии(Команда)
	Результат = Whatsgate_Клиент.УдалитьВсеСессии();
КонецПроцедуры
